[View in Colaboratory](https://colab.research.google.com/github/tkms0106/python-data-science/blob/master/python_data_science7_42.ipynb)

In [0]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [0]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [3]:
dframe

   dataset1  dataset2 k1     k2
0 -0.109430 -1.370013  X  alpha
1  0.163316 -1.328812  X   beta
2 -0.388909  0.320935  Y  alpha
3  0.874927 -0.346084  Y   beta
4  0.539815  1.781319  Z  alpha

In [0]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X    0.026943
Y    0.243009
Z    0.539815
Name: dataset1, dtype: float64

In [0]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array([ 'JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe

   dataset1  dataset2 k1     k2
0 -0.109430 -1.370013  X  alpha
1  0.163316 -1.328812  X   beta
2 -0.388909  0.320935  Y  alpha
3  0.874927 -0.346084  Y   beta
4  0.539815  1.781319  Z  alpha

In [10]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB    0.163316
    JAN   -0.388909
NY  FEB    0.874927
    JAN    0.215192
Name: dataset1, dtype: float64

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.026943 -1.349413
Y   0.243009 -0.012575
Z   0.539815  1.781319

In [13]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.109430 -1.370013
   beta   0.163316 -1.328812
Y  alpha -0.388909  0.320935
   beta   0.874927 -0.346084
Z  alpha  0.539815  1.781319

In [0]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [15]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -1.370013
   beta  -1.328812
Y  alpha  0.320935
   beta  -0.346084
Z  alpha  1.781319

In [16]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [19]:
for name, group in dframe.groupby('k1'):
  print('This is the {} group'.format(name))
  print(group)
  print('\n')

This is the X group
   dataset1  dataset2 k1     k2
0 -0.109430 -1.370013  X  alpha
1  0.163316 -1.328812  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2 -0.388909  0.320935  Y  alpha
3  0.874927 -0.346084  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4  0.539815  1.781319  Z  alpha

In [21]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
  print('Key1 = {} Key2 = {}'.format(k1,k2))
  print(group)
  print('\n')

Key1 = X Key2 = alpha
   dataset1  dataset2 k1     k2
0  -0.10943 -1.370013  X  alpha


Key1 = X Key2 = beta
   dataset1  dataset2 k1    k2
1  0.163316 -1.328812  X  beta


Key1 = Y Key2 = alpha
   dataset1  dataset2 k1     k2
2 -0.388909  0.320935  Y  alpha


Key1 = Y Key2 = beta
   dataset1  dataset2 k1    k2
3  0.874927 -0.346084  Y  beta


Key1 = Z Key2 = alpha
   dataset1  dataset2 k1     k2
4  0.539815  1.781319  Z  alpha

In [0]:
gr = dframe.groupby('k1')

In [23]:
gr.get_group('X')

   dataset1  dataset2 k1     k2
0 -0.109430 -1.370013  X  alpha
1  0.163316 -1.328812  X   beta

In [0]:
group_dict = dict(list(dframe.groupby('k1')))

In [25]:
group_dict

{'X':    dataset1  dataset2 k1     k2
 0 -0.109430 -1.370013  X  alpha
 1  0.163316 -1.328812  X   beta, 'Y':    dataset1  dataset2 k1     k2
 2 -0.388909  0.320935  Y  alpha
 3  0.874927 -0.346084  Y   beta, 'Z':    dataset1  dataset2 k1     k2
 4  0.539815  1.781319  Z  alpha}

In [26]:
group_dict['X']

   dataset1  dataset2 k1     k2
0 -0.109430 -1.370013  X  alpha
1  0.163316 -1.328812  X   beta

In [0]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [29]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.109430 -1.370013
 1  0.163316 -1.328812
 2 -0.388909  0.320935
 3  0.874927 -0.346084
 4  0.539815  1.781319, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}